{"The Manhunt":"The Manhunt\n\nAfter the first phase,\nafter passionate nights and intimate days,\n\nonly then would he let me trace\nthe frozen river which ran through his face,\n\nonly then would he let me explore\nthe blown hinge of his lower jaw,\n\nand handle and hold\nthe damaged, porcelain collar-bone,\n\nand mind and attend\nthe fractured rudder of a shoulder-blade,\n\nand finger and thumb\nthe parachute silk of his punctured lung.\n\nOnly then could I bind the struts\nand climb the rungs of his broken ribs,\n\nand feel the hurt\nof his grazed heart.\n\nSkirting along,\nonly then could I picture the scan,\n\nthe foetus of metal beneath his chest\nwhere the bullet had finally come to rest.\n\nThen I widened the search,\ntracing the scarring back to its source\n\nto a sweating, unexploded mine\nburied deep in his mind, around which\n\nevery nerve in his body had tightened and closed.\nThen, and only then, did I come close.\n\nSimon Armitage","Sonnet 43":"Sonnet 43\n\nHow do I love thee? Let me count the ways.\n    I love thee to the depth and breadth and height\n    My soul can reach, when feeling out of sight\nFor the ends of Being and ideal Grace.\nI love thee to the level of every day's\n    Most quiet need, by sun and candle-light.\n    I love thee freely, as men strive for Right.\nI love thee purely, as they turn from Praise.\nI love thee with the passion put to use\n    In my old griefs, and with my childhood's faith.\nI love thee with a love I seemed to lose\n    With my lost saints - I love thee with the breath,\nSmiles, tears, of all my life! - and, if God choose,\n    I shall but love thee better after death.\n\nElizabeth Barrett Browning","London":"London\n\nI wander thro' each charter'd street,\nNear where the charter'd Thames does flow,\nAnd mark in every face I meet\nMarks of weakness, marks of woe.\n\nIn every cry of every Man,\nIn every Infant's cry of fear,\nIn every voice, in every ban,\nThe mind-forg'd manacles I hear.\n\nHow the Chimney-sweeper's cry\nEvery blackening Church appalls;\nAnd the hapless Soldier's sigh\nRuns in blood down palace walls.\n\nBut most thro' midnight streets I hear\nHow the youthful Harlot's curse\nBlasts the newborn Infant's tear,\nAnd blights with plagues the Marrige hearse.\n\nWilliam Blake","The Soldier":"The Soldier\n\nIf I should die, think only this of me:\n  That there's some corner of a foreign field\nThat is for ever England. There shall be\n  In that rich earth a richer dust concealed;\nA dust whom England bore, shaped, made aware,\n  Gave, once, her flowers to love, her ways to roam,\nA body of England's, breathing English air,\n  Washed by the rivers, blest by suns of home.\n\nAnd think, this heart, all evil shed away,\n  A pulse in the eternal mind, no less\n    Gives somewhere back the thoughts by England given;\nHer sights and sounds; dreams happy as her day;\n  And laughter, learnt of friends; and gentleness,\n    In hearts at peace, under an English heaven.\n\nRupert Brooke","She Walks in Beauty":"She Walks in Beauty\n\nShe walks in beauty, like the night\n    Of cloudless climes and starry skies;\nAnd all that's best of dark and bright\n    Meet in her aspect and her eyes:\nThus mellowed to that tender light\n    Which Heaven to gaudy day denies.\n\nOne shade the more, one ray the less,\n    Had half impaired the nameless grace\nWhich waves in every raven tress,\n    Or softly lightens o'er her face;\nWhere thoughts serenely sweet express,\n    How pure, how dear their dwelling-place.\n\nAnd on that cheek, and o'er that brow,\n    So soft, so calm, yet eloquent,\nThe smiles that win, the tints that glow,\n    But tell of days in goodness spent,\nA mind at peace with all below,\n    A heart whose love is innocent\n\nLord Byron","Living Space":"Living Space\n\nThere are just not enough\nstraight lines. That\nis the problem.\nNothing is flat\nor parallel. Beams\nbalance crookedly on supports\nthrust off the vertical.\nNails clutch at open seams.\nThe whole structure leans dangerously\ntowards the miraculous.\n\nInto this rough frame,\nsomeone has squeezed\na living space\n\nand even dared to place\nthese eggs in a wire basket,\nfragile curves of white\nhung out over the dark edge\nof a slanted universe,\ngathering the light\ninto themseleves,\nas if they were\nthe bright, thin walls of faith.\n\nImtiaz Dharker","As Imperceptibly as Grief":"As Imperceptibly as Grief\n\nAs imperceptibly as Grief\nThe Summer lapsed away -\nToo imperceptible at last\nTo seem like Perfidy -\nA Quietness distilled\nAs Twilight long begun,\nOr Nature spending with herself\nSequestered Afternoon -\nThe Dusk drew earlier in -\nThe Morning foreign shone -\nA courteous, yet harrowing Grace,\nAs Guest, that would be gone -\nAnd thus, without a Wing\nOr service of a Keel\nOur Summer made her light escape\nInto the Beautiful.\n\nEmily Dickinson","Cozy Apologia":"Cozy Apologia\n\n                  -for Fred\n\nI could pick anything and think of you-\nThis lamp, the wind-still rain, the glossy blue\nMy pen exudes, drying matte, upon the page.\nI could choose any hero, any cause or age\nAnd, sure as shooting arrows to the heart,\nAstride a dappled mare, legs braced as far apart\nAs standing in silver stirrups will allow-\nThere you'll be, with furrowed brow\nAnd chain mail glinting, to set me free:\nOne eye smiling, the other firm upon the enemy,\n\nThis post-post-modern age is all business: compact disks\nAnd faxes, a do-it-now-and-take-no-risks\nEvent. Today a hurricane is nudging up the coast,\nOddly male: Big Bad Floyd, who brings a host\nOf daydreams: awkward reminiscences\nOf teenage crushes on worthless boys\nWhose only talent was to kiss you senseless.\nThey all had sissy names-Marcel, Percy, Dewey;\nWere thin as licorice and as chewy,\nSweet with a dark and hollow center. Floyd's\n\nCussing up a storm. You're bunkered in your\nAerie, I'm perched in mine\n(Twin desks, computers, hardwood floors):\nWe're content, but fall short of the Divine.\nStill, it's embarrassing, this happiness-\nWho's satisfied simply with what's good for us,\nWhen has the ordinary ever been news?\nAnd yet, because nothing else will do\nTo keep me from melancholy (call it blues),\nI fill this stolen time with you.\n\nRita Dove","Valentine":"Valentine\n\nNot a red rose or a satin heart.\n\nI give you an onion.\nIt is a moon wrapped in brown paper.\nIt promises light\nlike the careful undressing of love.\n\nHere.\nIt will blind you with tears\nlike a lover.\nIt will make your reflection\na wobbling photo of grief.\n\nI am trying to be truthful.\n\nNot a cute card or a kissogram.\n\nI give you an onion.\nIts fierce kiss will stay on your lips,\npossessive and faithful\nas we are,\nfor as long as we are.\n\nTake it.\nIts platinum loops shrink to a wedding-ring,\nif you like.\nLethal.\nIts scent will cling to your fingers,\ncling to your knife.\n\nCarol Ann Duffy","A Wife in London":"A Wife in London\n\nI - The Tragedy\n\nShe sits in the tawny vapour\n    That the City lanes have uprolled,\n    Behind whose webby fold on fold\nLike a waning taper\n    The street-lamp glimmers cold.\n\n\nA messenger's knock cracks smartly,\n    Flashed news is in her hand\n    Of meaning it dazes to understand\nThough shaped so shortly:\n    He - has fallen - in the far South Land ...\n\nII - The Irony\n\n'Tis the morrow; the fog hangs thicker,\n    The postman nears and goes:\n    A letter is brought whose lines disclose\nBy the firelight flicker\n    His hand, whom the worm now knows:\n\n\nFresh - firm - penned in highest feather -\n    Page-full of his hoped return,\n    And of home-planned jaunts by brake and burn\nIn the summer weather,\n    And of new love that they would learn.\n\nThomas Hardy","Death of a Naturalist":"Death of a Naturalist\n\nAll year the flax-dam festered in the heart\nOf the townland; green and heavy headed\nFlax had rotted there, weighted down by huge sods.\nDaily it sweltered in the punishing sun.\nBubbles gargled delicately, bluebottles\nWove a strong gauze of sound around the smell.\nThere were dragon-flies, spotted butterflies,\nBut best of all was the warm thick slobber\nOf frogspawn that grew like clotted water\nIn the shade of the banks. Here, every spring\nI would fill jampotfuls of the jellied\nSpecks to range on window-sills at home,\nOn shelves at school, and wait and watch until\nThe fattening dots burst into nimble-\nSwimming tadpoles. Miss Walls would tell us how\nThe daddy frog was called a bullfrog\nAnd how he croaked and how the mammy frog\nLaid hundreds of little eggs and this was\nFrogspawn. You could tell the weather by frogs too\nFor they were yellow in the sun and brown\nIn rain.\n\n    Then one hot day when fields were rank\nWith cowdung in the grass and angry frogs\nInvaded the flax-dam; I ducked through hedges\nTo a coarse croaking that I had not heard\nBefore. The air was thick with a bass chorus.\nRight down the dam gross-bellied frogs were cocked\nOn sods; their loose necks pulsed like sails. Some hopped:\nThe slap and plop were obscene threats. Some sat\nPoised like mud grenades, their blunt heads farting.\nI sickened, turned and ran. The great slime kings\nWere gathered there for vengance and I knew\nThat if I dipped my hand the spawn would clutch it.\n\nSeamus Heaney","Hawk Roosting":"Hawk Roosting\n\nI sit in the top of the wood, my eyes closed.\nInaction, no falsifying dream\nBetween my hooked head and hooked feet:\nOr in sleep rehearse perfect kills and eat.\n\nThe convenience of the high trees!\nThe air's buoyancy and the sun's ray\nAre of advantage to me;\nAnd the earth's face upward for my inspection.\n\nMy feet are locked upon the rough bark.\nIt took the whole of Creation\nTo produce my foot, my each feather:\nNow I hold Creation in my foot\n\nOr fly up, and revolve it all slowly -\nI kill where I please because it is all mine.\nThere is no sophistry in my body:\nMy manners are tearing off heads -\n\nThe allotment of death.\nFor the one path of my flight is direct\nThrough the bones of the living.\nNo arguments assert my right:\n\nThe sun is behind me.\nNothing has changed since I began.\nMy eye has permitted no change.\nI am going to keep things like this.\n\nTed Hughes","To Autumn":"To Autumn\n\nSeasons of mist and mellow fruitfulness!\n  Close bosom-friend of the maturing sun;\nConspiring with him how to load and bless\n  With fruit the vines that round the thatch-eaves run;\nTo bend with apples the moss'd cottage-trees,\n  And fill all fruit with ripeness to the core;\n    To swell the gourd, and plump the hazel shells\n  With a sweet kernel; to set budding more,\nAnd still more, later flowers for the bees,\nUntil they think warm days will never cease,\n    For Summer has o'erbrimmed their clammy cells.\n\nWho hath not seen thee oft amid thy store?\n  Sometimes whoever seeks abroad may find\nThee sitting careless on a granary floor,\n  Thy hair soft-lifted by the winnowing wind;\nOr on a half-reap'd furrow sound asleep,\n  Drows'd with the fume of poppies, while thy hook\n    Spares the next swath and all its twined flowers;\nAnd sometimes like a gleaner thou dost keep\n  Steady thy laden head across a brook;\n  Or by a cyder-press, with patient look,\n    Thou watchest the last oozings hours by hours.\n\nWhere are the songs of Spring? Ay, where are they?\n  Think not of them, thou hast thy music too, -\nWhile barred clouds bloom the soft-dying day,\n  And touch the stubble-plains with rosy hue;\nThen in a wailful choir the small gnats mourn\n  Among the river sallows, borne aloft\n    Or sinking as the light wind lives or dies;\nAnd full-grown lambs loud bleat from hilly bourn;\n  Hedge-crickets sing; and now with treble soft\n  The red-breast whistles from a garden-croft;\n    And gathering swallows twitter in the skies.\n\nJohn Keats","Afternoons":"Afternoons\n\nSummer is fading:\nThe leaves fall in ones and twos\nFrom trees bordering\nThe new recreation ground.\nIn the hollows of afternoons\nYoung mothers assemble\nAt swing and sandpit\nSetting free their children.\n\nBehind them, at intervals,\nStand husbands in skilled trades,\nAn estateful of washing,\nAnd the albums, lettered\nOur Wedding, lying\nNear the television:\nBefore them, the wind\nIs ruining their courting-places\n\nThat are still courting-places\n(But the lovers are all in school),\nAnd their children, so intent on\nFinding more unripe acorns,\nExpect to be taken home.\nTheir beauty has thickened.\nSomething is pushing them\nTo the side of their own lives.\n\nPhilip Larkin","Dulce et Decorum Est":"Dulce et Decorum Est\n\nBent double, like old beggars under sacks,\nKnock-kneed, coughing like hags, we cursed through sludge,\nTill on the haunting flares we turned our backs\nAnd towards our distant rest began to trudge.\nMen marched asleep. Many had lost their boots\nBut limped on, blood-shod. All went lame; all blind;\nDrunk with fatigue; deaf even to the hoots\nOf gas shells dropping softly behind.\n\nGas! Gas! Quick, boys! - An ecstasy of fumbling,\nFitting the clumsy helmets just in time;\nBut someone still was yelling out and stumbling,\nAnd flound'ring like a man in fire or lime ...\nDim, through the misty panes and thick green light,\nAs under a green sea, I saw him drowning.\n\nIn all my dreams, before my helpless sight,\nHe plunges at me, guttering, chocking, drowning.\n\nIf in some smothering dreams you too could pace\nBehind the wagon that we flung him in,\nAnd watch the white eyes writhing in his face,\nHis hanging face, like a devil's sick of sin;\nIf you could hear, at every jolt, the blood \nCome gargling from the froth-corrupted lungs,\nObscene as cancer, bitter as the cud\nOf vile, incurable sores on innocent tongues, -\nMy friend, you would not tell with such high zest\nTo children ardent for some desperate glory,\nThe old Lie: Dulce et decorum est\nPro patria mori\n\nWilfred Owen","Ozymandias":"Ozymandias\n\nI met a traveller from an antique land\nWho said: Two vast and trunkless legs of stone\nStand in the desert. . . Near them, on the sand,\nHalf sunk, a shattered visage lies, whose frown,\nAnd wrinkled lip, and sneer of cold command,\nTell that its sculptor well those passions read\nWhich yet survive, stamped on these lifeless things,\nThe hand that mocked them, and the heart that fed:\nAnd on the pedestal these words appear:\n'My name is Ozymandias, king of kings:\nLook on my works, ye Mighty, and despair!'\nNothing beside remains. Round the decay\nOf that colossal wreck, boundless and bare\nThe lone and level sands stretch far away.\n\nPercy Bysshe Shelley","Mametz Wood":"Mametz Wood\n\nFor years afterwards the farmers found them -\nthe wasted young, turning up under their plough blades\nas they tended the land back into itself.\n\nA chit of bone, the china plate of a shoulder blade,\nthe relic of a finger, the blown\nand broken bird's egg of a skull,\n\nall mimicked now in flint, breaking blue in white\nacross this field where they were told to walk, not run,\ntowards the wood and its nesting machine guns.\n\nAnd even now the earth stands sentinel,\nreaching back into itself for reminders of what happened\nlike a wound working a foreign body to the surface of the skin.\n\nThis morning, twenty men buried in one long grave,\na broken mosaic of bone linked arm in arm,\ntheir skeletons paused mid dance-macabre\n\nin boots that outlasted them,\ntheir socketed heads tilted back at an angle\nand their jaws, those that have them, dropped open.\n\nAs if the notes they had sung\nhave only now, with this unearthing,\nslipped from their absent tongues.\n\nOwen Sheers","Excerpt from The Prelude":"Excerpt from The Prelude\n\n    And in the frosty season, when the sun\nWas set, and visible for many a mile\nThe cottage windows through the twilight blaz'd,\nI heeded not the summons: - happy time\nIt was, indeed, for all of us; to me\nIt was a time of rapture: clear and loud\nThe village clock toll'd six; I wheel'd about,\nProud and exulting, like an untir'd horse,\nThat cares not for his home. - All shod with steel,\nWe hiss'd along the polish'd ice, in games\nConfederate, imitative of the chace\nAnd woodland pleasures, the resounding horn,\nThe Pack loud bellowing, and the hunted hare.\nSo through the darkness and the cold we flew,\nAnd not a voice was idle; with the din,\nMeanwhile, the precipices rang aloud,\nThe leafless trees, and every icy crag\nTinkled like iron, while the distant hills\nInto the tumult sent an alien sound\nOf melancholy, not unnoticed, while the stars,\nEastward, were sparkling clear, and in the west\nThe orange sky of evening died away.\n\nWilliam Wordsworth","A Poison Tree":"A Poison Tree\n\nI was angry with my friend:\nI told my wrath, my wrath did end.\nI was angry with my for:\nI told it not, my wrath did grow.\n\nAnd I water'd it in fears,\nNight and morning with my tears;\nAnd I sunned it with smiles,\nAnd with soft deceitful wiles.\n\nAnd it grew both day and night,\nTill it bore an apple bright;\nAnd my foe beheld it shine,\nAnd he knew that it was mine,\n\nAnd into my garden stole\nWhen the night had veil'd the pole:\nIn the morning glad I see\nMy foe outstretch'd beneath the tree.\n\nWilliam Blake"}